#Easy
#Задача 1
fruits = ['манго', 'яблоко', 'дыня', 'груша']
number = 0
for i in fruits:
	number = number + 1
	print ('{}. {:>7}'.format(number, i))

#Задача 2
list1 = [15, 'fgh', [45, 26], 'a']
list2 = ['osk', 'bb', 'a', 15]
for i in list1:
	a = i in list2
	if a == True:
		list1.remove(i)
print(list1)

#Задача 3
first = [56, 8,37, 99, 456, 7, 489863, 10]
second = []
for i in first:
	if (i % 2) == 0:
		i = i / 4
		second.append(i)
	else:
		i = i * 2
		second.append(i)
print(second)

#Normal
#Задача 1
import math
orign = [86, 9, -8, 10, 1, 225, 14]
new = []
for i in orign:
	try:
		a = math.sqrt(i)
	except ValueError:
		a = 0.1
	if a % 1 == 0:
		a = int(a)
		new.append(a)
print(new)

#Задача 2
a = input('Введите дату в формате dd.mm.yyyy: ')
b = a.split('.')
print (b)
day = {'01':'первое', '02':'второе', '03':'третье', '04':'четвертое', '05':'пятое', '06':'шестое', '07':'седьмое', '08':'восьмое', '09':'девятое', '10':'десятое', 
'11':'одиннадцатое', '12':'двенадцатое', '13':'тринадцатое', '14':'четырнадцатое', '15':'пятнадцатое', '16':'шестнадцатое', '17':'семнадцатое',
 '18':'восемнадцатое', '19':'девятнадцатое', '20':'двадцатое', '21':'двадцать первое', '22':'двадцать второе', '23':'двадцать третье', 
 '24':'двадцать четвертое', '25':'двадцать пятое', '26':'двадцать шестое', '27':'двадцать седьмое', '28':'двадцать восьмое', '29':'двадцать девятое', 
 '30':'тридцатое', '31':'тридцать первое'}
month = {'01':'января', '02':'февраля', '03':'марта', '04':'апреля', '05':'мая', '06':'июня', '07':'июля', '08':'августа', '09':'сентября', 
'10':'октября','11':'ноября', '12':'декабря'}
data = '{} {} {} года'.format(day [b[0]], month [b[1]], b[2])
print(data)

#Задача 3
import random
rand = []
n = int(input ('Введите число: '))
while n >= len(rand):
	rand.append (random.randint (-100, 100))
print(rand)

#Задача 4
A = [86, 9, -8, 10, 1, 225, 14, 9, 10]
B = []
for i in A:
	a = i in B
	if a == False:
		B.append(i)
print (B)
C = []
for i in A:
	a = i in C
	if a == False:
		C.append(i)
	else: 
		C.remove(i)
print (C)